/*Ұтыс билет: Билет нөмері 000001 – 999999 аралығында билеттер саны бар, егер бастапқы үш санның цифраларының қосындысы соңғы үш санның цифраларының қосындысына тең болса, онда ол билет ұтыс билеті болып саналады. Барлығы неше ұтыс билеттері бар екенін табатын бағдарлама құрыңыз.
Мысалы:  123141*/
public static void main(String[] args) {
int a, b, c,d,e,f,k=0; 
for (int n = 100000; n < 999999;n++ ) 
{ 
a = n / 100000; 
b = n % 100000 / 10000; 
c = (( n % 100000) % 10000) / 1000; 
d = ((( n % 100000) % 10000) % 1000)/100; 
e = (((( n % 100000) % 10000) % 1000)%100)/10; 
f = (((((n % 100000) % 10000) % 1000)%100)%10); 
if ((a+b+c) == (d+e+f)) 
{ 
k++; 
} } System.out.print ("san " + k); }
