/*Торлар:Шахмат тақтасының өлшемі 8х8 екені және торлары екі түсті екені белгілі, мысалы ақ және қара 
түсті (суретке қараңыз). Әрбір тордың координатасы әріптерден және цифрлардын тұрады. Торлар горизонтал бойынша A-дан H-қа дейін әріптермен, вертикал бойынша 1-ден 8-ге дейін цифрлармен белгіленген. А1 қара түсті тор екенін байқаймыз. Берілген координата бойынша тордың түсін анықтау қажет.
Кіріс мәліметтері
жалғыз қатарында шахмат тақтасындағы тордың координатасы әріп және цифр. C5 немесе А2 
Шығыс мәліметтері
егер тор ақ болса, онда «WHITE» сөзін, ал егер қара болса, онда «BLACK» сөзін шығару керек.
*/
public static void main(String[] args) {
Scanner S=new Scanner(System.in);
String s;
char[] ch1={'-','A','B','C','D','E','F','G','H'};
int san,sum=0;
System.out.println("Vvedite koordinatu (naprimer A6)");
s=S.next();
char[] ch= s.toCharArray();
for(int i=1;i<9;i++)
{
if(ch[0]==ch1[i]) {sum+=i;break;}
}
san=(int)ch[1];
sum+=san;
if(sum%2==1) System.out.println("WHITE");
else System.out.println("BLACK");
}
